Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Pickethall.tmx
Source language: ar
Languages: en

source: والشفع والوتر
en: And the Even and the Odd,

source: والليل إذا يسر
en: And the night when it departeth,

source: هل في ذلك قسم لذي حجر
en: There surely is an oath for thinking man.

source: ألم تر كيف فعل ربك بعاد
en: Dost thou not consider how thy Lord dealt with (the tribe of) A'ad,

source: إرم ذات العماد
en: With many-columned Iram,

source: التي لم يخلق مثلها في البلاد
en: The like of which was not created in the lands;

source: وثمود الذين جابوا الصخر بالواد
en: And with (the tribe of) Thamud, who clove the rocks in the valley;

source: وفرعون ذي الأوتاد
en: And with Pharaoh, firm of might,

source: الذين طغوا في البلاد
en: Who (all) were rebellious (to Allah) in these lands,

source: فأكثروا فيها الفساد
en: And multiplied iniquity therein?

source: فصب عليهم ربك سوط عذاب
en: Therefore thy Lord poured on them the disaster of His punishment.

source: إن ربك لبالمرصاد
en: Lo! thy Lord is ever watchful.

source: فأما الإنسان إذا ما ابتلاه ربه فأكرمه ونعمه فيقول ربي أكرمن
en: As for man, whenever his Lord trieth him by honouring him, and is gracious unto him, he saith: My Lord honoureth me.

source: وأما إذا ما ابتلاه فقدر عليه رزقه فيقول ربي أهانن
en: But whenever He trieth him by straitening his means of life, he saith: My Lord despiseth me.

source: كلا بل لا تكرمون اليتيم
en: Nay, but ye (for your part) honour not the orphan

source: ولا تحاضون على طعام المسكين
en: And urge not on the feeding of the poor.

source: وتأكلون التراث أكلا لما
en: And ye devour heritages with devouring greed.

source: وتحبون المال حبا جما
en: And love wealth with abounding love.

source: كلا إذا دكت الأرض دكا دكا
en: Nay, but when the earth is ground to atoms, grinding, grinding,

source: وجاء ربك والملك صفا صفا
en: And thy Lord shall come with angels, rank on rank,

source: وجيء يومئذ بجهنم يومئذ يتذكر الإنسان وأنى له الذكرى
en: And hell is brought near that day; on that day man will remember, but how will the remembrance (then avail him)?

source: يقول يا ليتني قدمت لحياتي
en: He will say: Ah, would that I had sent before me (some provision) for my life!

source: فيومئذ لا يعذب عذابه أحد
en: None punisheth as He will punish on that day!

source: ولا يوثق وثاقه أحد
en: None bindeth as He then will bind.

source: يا أيتها النفس المطمئنة
en: But ah! thou soul at peace!

source: ارجعي إلى ربك راضية مرضية
en: Return unto thy Lord, content in His good pleasure!

source: فادخلي في عبادي
en: Enter thou among My bondmen!

source: وادخلي جنتي
en: Enter thou My Garden!

source: لا أقسم بهذا البلد
en: Nay, I swear by this city -

source: وأنت حل بهذا البلد
en: And thou art an indweller of this city -

source: ووالد وما ولد
en: And the begetter and that which he begat,

source: لقد خلقنا الإنسان في كبد
en: We verily have created man in an atmosphere:

source: أيحسب أن لن يقدر عليه أحد
en: Thinketh he that none hath power over him?

source: يقول أهلكت مالا لبدا
en: And he saith: I have destroyed vast wealth:

source: أيحسب أن لم يره أحد
en: Thinketh he that none beholdeth him?

source: ألم نجعل له عينين
en: Did We not assign unto him two eyes

source: ولسانا وشفتين
en: And a tongue and two lips,

source: وهديناه النجدين
en: And guide him to the parting of the mountain ways?

source: فلا اقتحم العقبة
en: But he hath not attempted the Ascent -

source: وما أدراك ما العقبة
en: Ah, what will convey unto thee what the Ascent is! -

source: فك رقبة
en: (It is) to free a slave,

source: أو إطعام في يوم ذي مسغبة
en: And to feed in the day of hunger.

source: يتيما ذا مقربة
en: An orphan near of kin,

source: أو مسكينا ذا متربة
en: Or some poor wretch in misery,

source: ثم كان من الذين آمنوا وتواصوا بالصبر وتواصوا بالمرحمة
en: And to be of those who believe and exhort one another to perseverance and exhort one another to pity.

source: أولئك أصحاب الميمنة
en: Their place will be on the right hand.

source: والذين كفروا بآياتنا هم أصحاب المشأمة
en: But those who disbelieve Our revelations, their place will be on the left hand.

source: عليهم نار مؤصدة
en: Fire will be an awning over them.

source: والشمس وضحاها
en: By the sun and his brightness,

source: والقمر إذا تلاها
en: And the moon when she followeth him,

source: والنهار إذا جلاها
en: And the day when it revealeth him,

source: والليل إذا يغشاها
en: And the night when it enshroudeth him,

source: والسماء وما بناها
en: And the heaven and Him Who built it,

source: والأرض وما طحاها
en: And the earth and Him Who spread it,

source: ونفس وما سواها
en: And a soul and Him Who perfected it

source: فألهمها فجورها وتقواها
en: And inspired it (with conscience of) what is wrong for it and (what is) right for it.

source: قد أفلح من زكاها
en: He is indeed successful who causeth it to grow,

source: وقد خاب من دساها
en: And he is indeed a failure who stunteth it.

source: كذبت ثمود بطغواها
en: (The tribe of) Thamud denied (the truth) in their rebellious pride,

source: إذ انبعث أشقاها
en: When the basest of them broke forth

source: فقال لهم رسول الله ناقة الله وسقياها
en: And the messenger of Allah said: It is the she-camel of Allah, so let her drink!

source: فكذبوه فعقروها فدمدم عليهم ربهم بذنبهم فسواها
en: But they denied him, and they hamstrung her, so Allah doomed them for their sin and rased (their dwellings).

source: ولا يخاف عقباها
en: He dreadeth not the sequel (of events).

source: والليل إذا يغشى
en: By the night enshrouding

source: والنهار إذا تجلى
en: And the day resplendent

source: وما خلق الذكر والأنثى
en: And Him Who hath created male and female,

source: إن سعيكم لشتى
en: Lo! your effort is dispersed (toward divers ends).

source: فأما من أعطى واتقى
en: As for him who giveth and is dutiful (toward Allah)

source: وصدق بالحسنى
en: And believeth in goodness;

source: فسنيسره لليسرى
en: Surely We will ease his way unto the state of ease.

source: وأما من بخل واستغنى
en: But as for him who hoardeth and deemeth himself independent,

source: وكذب بالحسنى
en: And disbelieveth in goodness;

source: فسنيسره للعسرى
en: Surely We will ease his way unto adversity.

source: وما يغني عنه ماله إذا تردى
en: His riches will not save him when he perisheth.

source: إن علينا للهدى
en: Lo! Ours it is (to give) the guidance

source: وإن لنا للآخرة والأولى
en: And lo! unto Us belong the latter portion and the former.

source: فأنذرتكم نارا تلظى
en: Therefor have I warned you of the flaming Fire

source: لا يصلاها إلا الأشقى
en: Which only the most wretched must endure,

source: الذي كذب وتولى
en: He who denieth and turneth away.

source: وسيجنبها الأتقى
en: Far removed from it will be the righteous

source: الذي يؤتي ماله يتزكى
en: Who giveth his wealth that he may grow (in goodness).

source: وما لأحد عنده من نعمة تجزى
en: And none hath with him any favour for reward,

source: إلا ابتغاء وجه ربه الأعلى
en: Except as seeking (to fulfil) the purpose of his Lord Most High.

source: ولسوف يرضى
en: He verily will be content.

source: والضحى
en: By the morning hours

source: والليل إذا سجى
en: And by the night when it is stillest,

source: ما ودعك ربك وما قلى
en: Thy Lord hath not forsaken thee nor doth He hate thee,

source: وللآخرة خير لك من الأولى
en: And verily the latter portion will be better for thee than the former,

source: ولسوف يعطيك ربك فترضى
en: And verily thy Lord will give unto thee so that thou wilt be content.

source: ألم يجدك يتيما فآوى
en: Did He not find thee an orphan and protect (thee)?

source: ووجدك ضالا فهدى
en: Did He not find thee wandering and direct (thee)?

source: ووجدك عائلا فأغنى
en: Did He not find thee destitute and enrich (thee)?

source: فأما اليتيم فلا تقهر
en: Therefor the orphan oppress not,

source: وأما السائل فلا تنهر
en: Therefor the beggar drive not away,

source: وأما بنعمة ربك فحدث
en: Therefor of the bounty of thy Lord be thy discourse.

source: ألم نشرح لك صدرك
en: Have We not caused thy bosom to dilate,

source: ووضعنا عنك وزرك
en: And eased thee of the burden

source: الذي أنقض ظهرك
en: Which weighed down thy back;

source: ورفعنا لك ذكرك
en: And exalted thy fame?

source: فإن مع العسر يسرا
en: But lo! with hardship goeth ease,

source: إن مع العسر يسرا
en: Lo! with hardship goeth ease;

source: فإذا فرغت فانصب
en: So when thou art relieved, still toil

source: وإلى ربك فارغب
en: And strive to please thy Lord.

source: والتين والزيتون
en: By the fig and the olive,

source: وطور سينين
en: By Mount Sinai,

source: وهذا البلد الأمين
en: And by this land made safe;

source: لقد خلقنا الإنسان في أحسن تقويم
en: Surely We created man of the best stature

source: ثم رددناه أسفل سافلين
en: Then we reduced him to the lowest of the low,

source: إلا الذين آمنوا وعملوا الصالحات فلهم أجر غير ممنون
en: Save those who believe and do good works, and theirs is a reward unfailing.

source: فما يكذبك بعد بالدين
en: So who henceforth will give the lie to thee about the judgment?

source: أليس الله بأحكم الحاكمين
en: Is not Allah the most conclusive of all judges?

source: اقرأ باسم ربك الذي خلق
en: Read: In the name of thy Lord Who createth,

source: خلق الإنسان من علق
en: Createth man from a clot.

source: اقرأ وربك الأكرم
en: Read: And thy Lord is the Most Bounteous,

source: الذي علم بالقلم
en: Who teacheth by the pen,

source: علم الإنسان ما لم يعلم
en: Teacheth man that which he knew not.

source: كلا إن الإنسان ليطغى
en: Nay, but verily man is rebellious

source: أن رآه استغنى
en: That he thinketh himself independent!

source: إن إلى ربك الرجعى
en: Lo! unto thy Lord is the return.

source: أرأيت الذي ينهى
en: Hast thou seen him who dissuadeth

source: عبدا إذا صلى
en: A slave when he prayeth?

source: أرأيت إن كان على الهدى
en: Hast thou seen if he relieth on the guidance (of Allah)

source: أو أمر بالتقوى
en: Or enjoineth piety?

source: أرأيت إن كذب وتولى
en: Hast thou seen if he denieth (Allah's guidance) and is froward?

source: ألم يعلم بأن الله يرى
en: Is he then unaware that Allah seeth?

source: كلا لئن لم ينته لنسفعا بالناصية
en: Nay, but if he cease not We will seize him by the forelock -

source: ناصية كاذبة خاطئة
en: The lying, sinful forelock -

source: فليدع ناديه
en: Then let him call upon his henchmen!

source: سندع الزبانية
en: We will call the guards of hell.

source: كلا لا تطعه واسجد واقترب
en: Nay, Obey not thou him. But prostrate thyself, and draw near (unto Allah).

source: إنا أنزلناه في ليلة القدر
en: Lo! We revealed it on the Night of Predestination.

source: وما أدراك ما ليلة القدر
en: Ah, what will convey unto thee what the Night of Power is!

source: ليلة القدر خير من ألف شهر
en: The Night of Power is better than a thousand months.

source: تنزل الملائكة والروح فيها بإذن ربهم من كل أمر
en: The angels and the Spirit descend therein, by the permission of their Lord, with all decrees.

source: سلام هي حتى مطلع الفجر
en: (The night is) Peace until the rising of the dawn.

source: لم يكن الذين كفروا من أهل الكتاب والمشركين منفكين حتى تأتيهم البينة
en: Those who disbelieve among the People of the Scripture and the idolaters could not have left off (erring) till the clear proof came unto them,

source: رسول من الله يتلو صحفا مطهرة
en: A messenger from Allah, reading purified pages

source: فيها كتب قيمة
en: Containing correct scriptures.

source: وما تفرق الذين أوتوا الكتاب إلا من بعد ما جاءتهم البينة
en: Nor were the People of the Scripture divided until after the clear proof came unto them.

source: وما أمروا إلا ليعبدوا الله مخلصين له الدين حنفاء ويقيموا الصلاة ويؤتوا الزكاة وذلك دين القيمة
en: And they are ordered naught else than to serve Allah, keeping religion pure for Him, as men by nature upright, and to establish worship and to pay the poor-due. That is true religion.

source: إن الذين كفروا من أهل الكتاب والمشركين في نار جهنم خالدين فيها أولئك هم شر البرية
en: Lo! those who disbelieve, among the People of the Scripture and the idolaters, will abide in fire of hell. They are the worst of created beings.

source: إن الذين آمنوا وعملوا الصالحات أولئك هم خير البرية
en: (And) lo! those who believe and do good works are the best of created beings.

source: جزاؤهم عند ربهم جنات عدن تجري من تحتها الأنهار خالدين فيها أبدا رضي الله عنهم ورضوا عنه ذلك لمن خشي ربه
en: Their reward is with their Lord: Gardens of Eden underneath which rivers flow, wherein they dwell for ever. Allah hath pleasure in them and they have pleasure in Him. This is (in store) for him who feareth his Lord.

source: إذا زلزلت الأرض زلزالها
en: When Earth is shaken with her (final) earthquake

source: وأخرجت الأرض أثقالها
en: And Earth yieldeth up her burdens,

source: وقال الإنسان ما لها
en: And man saith: What aileth her?

source: يومئذ تحدث أخبارها
en: That day she will relate her chronicles,

source: بأن ربك أوحى لها
en: Because thy Lord inspireth her.

source: يومئذ يصدر الناس أشتاتا ليروا أعمالهم
en: That day mankind will issue forth in scattered groups to be shown their deeds.

source: فمن يعمل مثقال ذرة خيرا يره
en: And whoso doeth good an atom's weight will see it then,

source: ومن يعمل مثقال ذرة شرا يره
en: And whoso doeth ill an atom's weight will see it then.

source: والعاديات ضبحا
en: By the snorting courses,

source: فالموريات قدحا
en: Striking sparks of fire

source: فالمغيرات صبحا
en: And scouring to the raid at dawn,

source: فأثرن به نقعا
en: Then, therewith, with their trail of dust,

source: فوسطن به جمعا
en: Cleaving, as one, the centre (of the foe),

source: إن الإنسان لربه لكنود
en: Lo! man is an ingrate unto his Lord

source: وإنه على ذلك لشهيد
en: And lo! he is a witness unto that;

source: وإنه لحب الخير لشديد
en: And lo! in the love of wealth he is violent.

source: أفلا يعلم إذا بعثر ما في القبور
en: Knoweth he not that, when the contents of the graves are poured forth

source: وحصل ما في الصدور
en: And the secrets of the breasts are made known,

source: إن ربهم بهم يومئذ لخبير
en: On that day will their Lord be perfectly informed concerning them.

source: القارعة
en: The Calamity!

source: ما القارعة
en: What is the Calamity?

source: وما أدراك ما القارعة
en: Ah, what will convey unto thee what the Calamity is!

source: يوم يكون الناس كالفراش المبثوث
en: A day wherein mankind will be as thickly-scattered moths

source: وتكون الجبال كالعهن المنفوش
en: And the mountains will become as carded wool.

source: فأما من ثقلت موازينه
en: Then, as for him whose scales are heavy (with good works),

source: وأما من خفت موازينه
en: But as for him whose scales are light,

source: فأمه هاوية
en: A bereft and Hungry One will be his mother,

source: وما أدراك ما هيه
en: Ah, what will convey unto thee what she is! -

source: نار حامية
en: Raging Fire.

source: ألهاكم التكاثر
en: Rivalry in worldly increase distracteth you

source: حتى زرتم المقابر
en: Until ye come to the graves.

source: كلا سوف تعلمون
en: Nay, but ye will come to know!

source: ثم كلا سوف تعلمون
en: Nay, but ye will come to know!

source: كلا لو تعلمون علم اليقين
en: Nay, would that ye knew (now) with a sure knowledge!

source: لترون الجحيم
en: For ye will behold hell-fire.

source: ثم لترونها عين اليقين
en: Aye, ye will behold it with sure vision.

source: ثم لتسألن يومئذ عن النعيم
en: Then, on that day, ye will be asked concerning pleasure.

source: والعصر
en: By the declining day,

source: إن الإنسان لفي خسر
en: Lo! man is a state of loss,

source: إلا الذين آمنوا وعملوا الصالحات وتواصوا بالحق وتواصوا بالصبر
en: Save those who believe and do good works, and exhort one another to truth and exhort one another to endurance.

source: ويل لكل همزة لمزة
en: Woe unto every slandering traducer,

source: الذي جمع مالا وعدده
en: Who hath gathered wealth (of this world) and arranged it.

source: يحسب أن ماله أخلده
en: He thinketh that his wealth will render him immortal.

source: كلا لينبذن في الحطمة
en: Nay, but verily he will be flung to the Consuming One.

source: وما أدراك ما الحطمة
en: Ah, what will convey unto thee what the Consuming One is!

source: نار الله الموقدة
en: (It is) the fire of Allah, kindled,

source: التي تطلع على الأفئدة
en: Which leapeth up over the hearts (of men).

source: إنها عليهم مؤصدة
en: Lo! it is closed in on them

source: في عمد ممددة
en: In outstretched columns.

source: ألم تر كيف فعل ربك بأصحاب الفيل
en: Hast thou not seen how thy Lord dealt with the owners of the Elephant?

source: ألم يجعل كيدهم في تضليل
en: Did He not bring their stratagem to naught,

source: وأرسل عليهم طيرا أبابيل
en: And send against them swarms of flying creatures,

source: ترميهم بحجارة من سجيل
en: Which pelted them with stones of baked clay,

source: فجعلهم كعصف مأكول
en: And made them like green crops devoured (by cattle)?

source: لإيلاف قريش
en: For the taming of Qureysh.

source: إيلافهم رحلة الشتاء والصيف
en: For their taming (We cause) the caravans to set forth in winter and summer.

source: فليعبدوا رب هذا البيت
en: So let them worship the Lord of this House,

source: الذي أطعمهم من جوع وآمنهم من خوف
en: Who hath fed them against hunger and hath made them safe from fear.

source: أرأيت الذي يكذب بالدين
en: Hast thou observed him who belieth religion?

source: فذلك الذي يدع اليتيم
en: That is he who repelleth the orphan,

source: فويل للمصلين
en: Ah, woe unto worshippers

source: الذين هم عن صلاتهم ساهون
en: Who are heedless of their prayer;

source: الذين هم يراءون
en: Who would be seen (at worship)

source: ويمنعون الماعون
en: Yet refuse small kindnesses!

source: إنا أعطيناك الكوثر
en: Lo! We have given thee Abundance;

source: فصل لربك وانحر
en: So pray unto thy Lord, and sacrifice.

source: إن شانئك هو الأبتر
en: Lo! it is thy insulter (and not thou) who is without posterity.

source: قل يا أيها الكافرون
en: Say: O disbelievers!

source: لا أعبد ما تعبدون
en: I worship not that which ye worship;

source: ولا أنتم عابدون ما أعبد
en: Nor worship ye that which I worship.

source: ولا أنا عابد ما عبدتم
en: And I shall not worship that which ye worship.

source: لكم دينكم ولي دين
en: Unto you your religion, and unto me my religion.

source: إذا جاء نصر الله والفتح
en: When Allah's succour and the triumph cometh

source: ورأيت الناس يدخلون في دين الله أفواجا
en: And thou seest mankind entering the religion of Allah in troops,

source: فسبح بحمد ربك واستغفره إنه كان توابا
en: Then hymn the praises of thy Lord, and seek forgiveness of Him. Lo! He is ever ready to show mercy.

source: تبت يدا أبي لهب وتب
en: The power of Abu Lahab will perish, and he will perish.

source: ما أغنى عنه ماله وما كسب
en: His wealth and gains will not exempt him.

source: سيصلى نارا ذات لهب
en: He will be plunged in flaming Fire,

source: وامرأته حمالة الحطب
en: And his wife, the wood-carrier,

source: في جيدها حبل من مسد
en: Will have upon her neck a halter of palm-fibre.

source: قل هو الله أحد
en: Say: He is Allah, the One!

source: الله الصمد
en: Allah, the eternally Besought of all!

source: لم يلد ولم يولد
en: He begetteth not nor was begotten.

source: ولم يكن له كفوا أحد
en: And there is none comparable unto Him.

source: قل أعوذ برب الفلق
en: Say: I seek refuge in the Lord of the Daybreak

source: من شر ما خلق
en: From the evil of that which He created;

source: ومن شر غاسق إذا وقب
en: From the evil of the darkness when it is intense,

source: ومن شر النفاثات في العقد
en: And from the evil of malignant witchcraft,

source: ومن شر حاسد إذا حسد
en: And from the evil of the envier when he envieth.

source: قل أعوذ برب الناس
en: Say: I seek refuge in the Lord of mankind,

source: ملك الناس
en: The King of mankind,

source: إله الناس
en: The god of mankind,

source: من شر الوسواس الخناس
en: From the evil of the sneaking whisperer,

source: الذي يوسوس في صدور الناس
en: Who whispereth in the hearts of mankind,

source: من الجنة والناس
en: Of the jinn and of mankind.
